Ran Plan for project: `kms/gyanni/ap-northeast-2` dir: `terraform-provisioning/terraform/kms/gyanni/ap-northeast-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.iam: Reading...
data.terraform_remote_state.iam: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_kms_alias.deployment_common_kms_alias will be created
+ resource "aws_kms_alias" "deployment_common_kms_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/deployment-common"
      + name_prefix    = (known after apply)
      + region         = "ap-northeast-2"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.deployment_common will be created
+ resource "aws_kms_key" "deployment_common" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for common secrets in ap-northeast-2."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "deployment-common"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.sops_gyanni.aws_kms_alias.common will be created
+ resource "aws_kms_alias" "common" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/sops-gyanni"
      + name_prefix    = (known after apply)
      + region         = "ap-northeast-2"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.sops_gyanni.aws_kms_alias.secure will be created
+ resource "aws_kms_alias" "secure" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/secure_sops-gyanni"
      + name_prefix    = (known after apply)
      + region         = "ap-northeast-2"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.sops_gyanni.aws_kms_key.common will be created
+ resource "aws_kms_key" "common" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for encrypt with sops the sops gyanni secrets in ap-northeast-2."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-common-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:role/gyanni-sops",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM Application Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Delete*",
                          + "kms:DisableKey",
                          + "kms:ScheduleKeyDeletion",
                        ]
                      + Condition = {
                          + ArnNotEquals = {
                              + "aws:SourceArn" = [
                                  + "arn:aws:iam::289574460446:root",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Deny key deletion Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.sops_gyanni.aws_kms_key.secure will be created
+ resource "aws_kms_key" "secure" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for encrypt with sops the secure sops gyanni secrets in ap-northeast-2."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-secure-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:root",
                            ]
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289574460446:role/gyanni-secure-sops",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM Application Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Delete*",
                          + "kms:DisableKey",
                          + "kms:ScheduleKeyDeletion",
                        ]
                      + Condition = {
                          + ArnNotEquals = {
                              + "aws:SourceArn" = [
                                  + "arn:aws:iam::289574460446:root",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Deny key deletion Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aws_kms_key_apne2_deployment_common_arn = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p kms/gyanni/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fkms%252Fgyanni%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p kms/gyanni/ap-northeast-2`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
